# Pandas

In [1]:
import numpy as np 
import pandas as pd

## Series

### 시리즈 생성

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s
## 값만 나오는 것이 아니라 index가 달려있는 것을 알 수 있음.

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [3]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [4]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [5]:
s['서울']

9904312

In [6]:
s[0]

9904312

In [7]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [8]:
type(s.values)

numpy.ndarray

In [9]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

### 시리즈 연산

In [10]:
s / 1000

도시
서울    9904.312
부산    3448.737
인천    2890.451
대구    2466.052
Name: 인구, dtype: float64

### 시리즈 인덱싱

In [11]:
s[1], s['부산']

(3448737, 3448737)

In [12]:
s[[1, 3]]

도시
부산    3448737
대구    2466052
Name: 인구, dtype: int64

In [13]:
s[['부산', '대구']]

도시
부산    3448737
대구    2466052
Name: 인구, dtype: int64

In [15]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [18]:
s['부산':'대구']

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [20]:
s[s>3e6]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [32]:
s0 = pd.Series(range(3), index=["a", "b", "c"])
s0

a    0
b    1
c    2
dtype: int64

In [33]:
s0.a

0

In [26]:
s.부산

3448737

In [39]:
s0.b

1

### 시리즈와 딕셔너리

In [28]:
'대구' in s

True

In [40]:
for key, value in s.items():        ## key 대신 k, value 대신 v라고 쓰기도 하는듯.
    print(f'{key} = {value}')

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [45]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [46]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
               index=["부산", "서울", "인천", "대전"])
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

### 인덱스 기반 연산

In [47]:
s - s2

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [48]:
s.values - s.values         # values면 numpy가 되는 것이라 뺄셈 연산이 되어버리는 것.?

array([0, 0, 0, 0], dtype=int64)

In [49]:
rs = (s - s2) / s2 * 100    # 증가율
rs

대구         NaN
대전         NaN
부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [50]:
rs.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [51]:
rs[rs.notnull()]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

### 데이터 갱신,추가,삭제

In [52]:
# 갱신
rs['부산'] = 1.64
rs

대구         NaN
대전         NaN
부산    1.640000
서울    2.832690
인천    9.818107
dtype: float64

In [53]:
# 추가
rs['대구'] = 1.41
rs

대구    1.410000
대전         NaN
부산    1.640000
서울    2.832690
인천    9.818107
dtype: float64

In [54]:
# 삭제
del rs['서울']
rs

대구    1.410000
대전         NaN
부산    1.640000
인천    9.818107
dtype: float64

### 데이터 프레임

In [56]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [5]:
df = pd.DataFrame(data, index=['서울','부산','인천','대구'],
                  columns=['지역','2015','2010','2005','2000','2010-2015 증가율'])
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [8]:
pd.DataFrame(np.arange(16).reshape(4,-1))

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [9]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [10]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [60]:
df.index.name = "도시"
df.columns.name = "항목"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [12]:
df.T

도시                  서울       부산       인천       대구
항목
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

### 열 데이터의 갱신,추가,삭제

In [63]:
# 갱신
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [64]:
# 추가
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [65]:
# 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

### 열 인덱싱

In [66]:
# 하나의 열만 인덱싱하면 시리즈가 반환된다.
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [67]:
# 여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다.
df[["2010", "2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [68]:
# 2010이라는 열을 반환하면서 데이터프레임 자료형을 유지
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [69]:
type(df[["2010"]])

pandas.core.frame.DataFrame

In [70]:
# 2010이라는 열을 반환하면서 시리즈 자료형으로 변환
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [71]:
type(df["2010"])

pandas.core.series.Series

In [72]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [73]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [74]:
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

In [75]:
df[:1]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [76]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [77]:
df[1:3]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [78]:
df["서울":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40

## 연습문제

In [80]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [88]:
## 1
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [85]:
## 2
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [89]:
## 3
df["평균"] = ((df['국어']) + df['영어'] + df["수학"] / 3).round(2)
df

    국어  영어  수학      평균
춘향  80  90  90  200.00
몽룡  90  70  60  180.00
향단  70  60  80  156.67
방자  30  40  70   93.33

In [92]:
df["평균"] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  88.44
몽룡  90  70  60  75.00
향단  70  60  80  71.36
방자  30  40  70  47.40

In [93]:
## 4
df["영어"]["방자"] = 80
del df["평균"]
df["평균"] = df.mean(axis=1).round(2)
df

<ipython-input-93-ce99f24cf881>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["영어"]["방자"] = 80

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [97]:
## 5
df[:"춘향"]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [99]:
## 5
df[:"춘향"].T

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [103]:
# 6
df.T["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64